code25_all/java/186945.txt

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:xs="http://www.w3.org/2001/XMLSchema" name="ITSOAPWebServiceservice" targetNamespace="http://tempuri.org/" xmlns:tns="http://tempuri.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/">
  <message name="WebMethod0Request">
    <part name="Document" type="xs:string"/>
  </message>
  <message name="WebMethod0Response">
    <part name="return" type="xs:boolean"/>
  </message>
  <portType name="ITSOAPWebService">
    <operation name="WebMethod">
      <input message="tns:WebMethod0Request"/>
      <output message="tns:WebMethod0Response"/>
    </operation>
  </portType>
  <binding name="ITSOAPWebServicebinding" type="tns:ITSOAPWebService">
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="WebMethod">
      <soap:operation soapAction="urn:TWebServiceIntf1-ITSOAPWebService#WebMethod" style="rpc"/>
      <input message="tns:WebMethod0Request">
        <soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="urn:TWebServiceIntf1-ITSOAPWebService"/>
      </input>
      <output message="tns:WebMethod0Response">
        <soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="urn:TWebServiceIntf1-ITSOAPWebService"/>
      </output>
    </operation>
  </binding>
  <service name="ITSOAPWebServiceservice">
    <port name="ITSOAPWebServicePort" binding="tns:ITSOAPWebServicebinding">
      <soap:address location="http://localhost:1024/soap/ITSOAPWebService"/>
    </port>
  </service>
</definitions>

definicions.binding.operation.input  
definitions.binding.operation.output

definitions.portType.operation.input  
definitions.portType.operation.output

